{
	"title": "Scrolly story",
	"subtitle": "Left-right layout",
	"authors": [
        { 
			"name": "Jonathan St-Onge", 
			"url": "https://complexstories.uvm.edu/author/jonathan-st-onge" 
		},
        { 
			"name": "Ben Cooley", 
			"url": "https://complexstories.uvm.edu/author/ben-dexter-cooley" 
		}
    ],
	"date": "Jan 20, 2026",
	"SectionTitle": "Hello world",
	"introduction": [
		{
			"type": "markdown",
			"value": "There are many different ways to structure code to do visual data essays."
		},
		{
			"type": "markdown",
			"value": "We use snippets combined with a copy.json to facilitate non-technical users to share their stories without knowing everything there is to know to get started."
		}
	],
	"steps": [
		{
			"type": "markdown",
			"value": "This is a scrolly story where the content shows on the left, matching the plot on the right. On mobile, the content appears on top of the plot, which takes the full client width."
		},
		{
			"type": "markdown",
			"value": "As we scroll, we **sort** the data, describing how a bar chart is best read when ordered by counts."
		},
		{
			"type": "markdown",
			"value": "We can change mark, here transitioning from barchart to lollipop. Note that here we always show the **same data**, but differently."
		}
	],
	"markdownRenderer": [
		{
			"type": "markdown",
			"value": "We also have a powerful markdown renderer that is worth mentioning. In the copy.json, you can use [markdown](https://www.markdownguide.org/), as one would expect.\n You can create newlines using `\\n` directly in the json, or add a different entry. The newline is useful for example when doing quote block\n>Dorothy followed her through many of the beautiful rooms in her castle."
		},
		{
			"type": "markdown",
			"value": "As scientists, it is key to have access to write mathematics too. You can do it inline in the markdown block, such as $f(x) = ax^{-k}$. Or using the math type to have equations on their own line:"
		},
		{
			"type": "math",
			"value": "$$f(cx)=a(cx)^{-k}=c^{-k}f(x) \\propto f(x)$$"
		},
		{
			"type": "markdown",
			"value": "Of course, <span style='color: red;'>html</span> is available too in markdown or its own block. All of this can be rendered in the text block of the scrolly story, see [this story](https://complexstories.uvm.edu/allotax-scrolly) for an example of that. Finally, there is the `code` block for more technical content:"
		},
		{
			"type": "code",
			"language": "js",
			"value": "<div class='scrolly-content'>\n  <div class='spacer'></div>\n    <Scrolly bind:value>\n    {#each steps as step, i (i)}\n    {@const active = value === i}\n    <div class='step' class:active>\n      <div class='step-content'>\n        {@render contentRenderer(step)}\n      </div>\n    </div>\n    {/each}\n    </Scrolly>\n  <div class='spacer'></div>\n</div>"
		},
		{
			"type": "markdown",
			"value": "This is a bit ungainly to write manually, as in the JSON the newlines and spacing needs to be done manually. But LLMs are pretty good at it. Also it is always possible to do outside the copy.json, like we do with for the copyable code snippet on the Home page. Not everything needs to be in copy.json, but it is useful for stories where different people must edit it."
		}
	],
	"conclusion": [
		{
			"type": "markdown",
			"value": "In conclusion, we saw how to programmatically have a scrolly story with content on the left and a shifting plot on the right."
		}
	]
}
